{
  "ITSP":"You are a curious and love to learn new things, you prefer following your own ideas and enjoy the experiences that life offers and take action actively. You are independent and have an adventurous spirit. When faced with problems, you approach them practically. You harbour the ability to focus in times of stress and think quickly. During emergencies, you are able to respond successfully. You are energized by spending time alone. You are selective in relationships and would appreciate a partner who gives freedom to do your own things. You are born a problem solver and bring practical solutions to suit the situation.",

  "ITNJ":"You have a natural thirst for knowledge and enjoy sharing it with others. You prefer paying more attention to application of your ideas and believe that with continuous effort, intelligence, determination and constant reflection, one can understand their true potentials and excel in any chosen task. You are open and willing to look at things from a different perspective. However, the final decisions are based on logical reasoning and how best the idea will prove to be. You have a perfectionistic approach and may set high performance standards for self. This may have a positive effect on your motivation to bring improvements in self. You have a clear vision of how future should look and work with dedication to make it happen. The profile reveals that you are usually quiet, but when the topic is interesting and stimulating, you can have a long conversation. Thus, you are selective about your relationships and prefer to associate with people with whom you connect on an  intellectual level. You tend to put in maximum efforts to reach your goals. These qualities will make you a successful leader.",

  "ITSJ":"You are an individual with a rich inner world which is not very prominent to others. You do not easily rely on assumptions instead pay more attention to facts. You make sure to complete the task once decided. You manage situations with honesty rather than mind games and manipulation. People can rely on you easily. Loyalty is the most precious gem for you and you stay faithful to your commitments. However, you may feel easily frustrated if others do not adhere to their promises. Your profile reveals that you are an introvert by nature. When it comes to friendships, you are the friend who will stay by in time of need. You have your own subtle ways of showing affection. When working in teams, you tend to pay attention to the details missed, flaws in the plan and bring factualness. You have the ability to analyze the plans, organize the work and help the team come at balanced decisions.",

  "IFSJ":"Your profile reveals that you have unique traits. You are a person who listens to your heart but at the same time have the capability to solve both complex and uncomplicated problems by making sensible decisions. You are a patient and down to earth individual. When you take any responsibility, you put in extra efforts to meet the expectations that others have. You have a practical approach towards life. You rely on common sense and experience in solving problems. You need to have a clear perspective about the plan and the steps needed to reach the goal. In the absence of a concrete plan, you are capable of making one and organizing the work effectively. You value your relationships highly and are motivated to provide help to others. You seek harmony in your relationships.",

  "IFNJ":"Your profile reveals that you appear to be a quiet person and an attentive listener. You have some unique qualities. You are an individual with strong opinions but have a very polite way of conveying it. You are genuinely interested in people and are often mistaken to be an extrovert. You understand people’s feelings which they do not show explicitly. You are imaginative and visionary but at the same time indulge in logical judgements. You choose firm and definite steps to attain the set objective. You have a huge pool of talents. When presented with multiple ideas, you are able to blend them and bring people together. You have an inspiring effect on people.",

  "EFNP":"Your profile reveals that you are flexible and spontaneous in nature. You like being surrounded with people. You are energized by spending time with others. You are an expressive communicator and prefer to use humor to speak your mind. You are someone who makes decisions on values and feelings. You place great value on interpersonal relationships and approach them with a enthusiasm and energy. You are an individual who is considerate , nurturing and a invests highly in relationship. You are viewed by you peers as the mind with most creative ideas. You learn best by hands on experience rather than by theoretical ways.",

  "ETNP":"You have a charming personality. You are able to impress people with your cleverness and humor. You are a quick thinker and have great observation skills. You are skilled to identify the loopholes, provide logical explanations about various phenomenons and find ways to use them in an advantageous manner. You have strong opinions and often convey them clearly to people. People might sometimes mistaken this for being argumentative. You have the ability to perceive situations from different angles and find creative solutions. You are stimulated by challenges and encourage others to face them a well.",

  "ETSJ":"You are a generous person who is loved by all. You make genuine efforts to bring the world a little closer. Your strong sense of dedication aids you to do the right thing. You tend to lead people through difficult paths and people come for guidance to you. You are strong willed and defend your opinions with steady efforts.You trust your judgements.You observe your environment to ensure everything around you is running smoothly and systematically. You are clear about how things should go.You put your hundred percent in every task you take up. You take pride in the respect of your community ,friends colleagues. You like meeting people and having fun but at times you may feel that you are been misunderstood and undervalued by people.",

  "EFSJ":"You have a strong sense of what is right and what is wrong , you also empathises very easily with others and you are sensitive to the needs of others. You are a responsible person. You have a strong practical skills and strong sense of duty you are very loyal person. You are a social person, seeking large circles of friends. You are the person who are always there for people providing emotional support to them and encouraging people .You make sure their friends are happy, You are naturally very popular among people. You are well-organized person You are may have excellent teaching skills. You are comfortable with authority, but are supportive and friendly enough to keep that authority from feeling overbearing. You feel comfortable when you are in busy social situations.",

  "EFNJ":"Your results reveal that you are a people focused person. You are a natural born leader full of passion and charisma. You take a great deal of pride and joy in guiding people to work together to improve self and your community. As you like to work in group you are highly tolerant and reliable person and a natural leader.You are in world to give love , support and good time to people. You live in the world of possibilities . You might avoid to live alone and fill activities living with other people.",

  "ETNJ":"Your results reveal that you are natural born leader and a growth oriented person. You are very decisive person, efficient in your work, energetic person, self confident, strong willed, strategic thinker you navigate the challenges and step of bigger plan . You are inspiring person and have charismatic qualities.The quality of being efficient, decisive person, people get inspired. When there is any flaws in system you see and enjoy the process of discovering the flaws and implement new thinkings. You are assertive and enjoy taking charge.",

  "IFSP":"You have an enticing and overwhelming persona which spell binds people around you You are sensitive to criticism. You are compassionate, can relate with others problems and offer them the best help you can. You like planning your actions and experiences since you feel a strong need to create a self identity. You like doing things out of the box, experimenting with the most creative ideas and coming up with new innovations. You have the ability to transform mess into organization. You are passionate about everything you do, you like to do even the riskiest job with utmost passion and tenacity and your ability to stay rock solid in the testing times gives you an edge over your friends.You value your relationships and give immense importance to honesty, integrity and the moral inclination.",

  "IFNP":"You crave for equanimity and harmony. You have an inherent ability to look for good in people around you. You have a deep understanding of the human mind, you can relate to them and come up with practical solutions to their problems instead of temporarily comforting them Fantasy and fiction excited you.You like getting lost in your thoughts, contemplating on hypothetical issues, coming up with intriguing ideas and brooding about things that matter to you. You are extremely ambitious, you plan your each move and wish to master the art of perfection. You come up with innovative solutions to your problems and try to avoid them in the first place. Your fellow mates and juniors hold you in high regard, your integrity, communication skills, farsightedness and the ability to take tough decisions makes you special.",

  "ITNP":"You do not settle for the established notions of the society, you like inventing your own and you spend most of your time looking for justifications and credibility of your ideas. You are usually shy among unfamiliar faces but with people of your clan, you feel comfortable and you are often fascinated by people who give you their time and energies and make efforts to understand all the perplex thoughts that preoccupy your brain most of the time.Your decisions, help, personality are all driven by reason, judgement, wisdom and sagacity. You are the possessor of unparalleled intelligence, creative genius and rational perspective. You are a good analyzer of things around you, analyzing it for intricacies and depths that are usually missed by a normal person. You tend to debate ideas in your head and try to find out all possible pieces of the puzzle yourself and in your attempt to do so.",

  "ETSP":"You are often the cynosure of all eyes, a dynamic persona with fascinating and magnetic energy in any party or get together. You possess an exceptional sense of humour which can lighten up a mundane atmosphere. You can instantly strike a conversation with the most reticent human beings and make them feel at home. You are inclined towards intelligent conversations with a blend of humour, recreation and frolic. You are equipped with highly qualified perception skills, you can notice the slightest of change and you also make an immediate remark to it which might not get along with sensitive individuals. You are extremely passionate and filled with tons of agility, you have the ability to induce zeal and energy in the most indolent creatures with your persuasive style of conversations. You can convince people into taking their decisions, gather them for a project, convert their indecisiveness and apathy into extreme forms of positive and optimistic enthusiasm. You believe in breaking the rules and changing them for the better. You are a change to reckon with.",

  "EFSP":"You are an altruistic person who loves helping people, talking them out of their problems. Your conversations are extremely witty and filled with humour and entertainment. Your deep regard for emotions and sensitivities brings you close to people and they feel connected to you. You believe in ordinary pleasures, coffee with a group of friends or simple outing in leisure times charges you up with immense energy You don't like to be in a box, for you, the box doesn't exist. Your unfathomable energy and irresistible desire to be loved makes you go overboard at times in your perspective. Your ability to bring everyone together for a task is praise worthy. People are often swayed over by your playfulness, charisma and charm.Your creativity reflects in the methodical way in which you work your home and surroundings. You life is driven with a tinge of drama in every aspect.",

  "Anger_low":"You maintain your calm and composure most of the times and only the most arduous circumstances can bring out the anger in you. Your anger is productive rather than destructive.",

  "Anger_high":"Identifying and accepting one’s feelings brings a sense of calmness. You tend to hold back these feelings and end up react to minor issues in a furious manner.This leads you to landing in a set of circumstances which might be unfortunate.",

  "SelfEsteem_low":"Though you might be one of the most creative and intellectual individuals, you aren't very confident about yourself. Your confidence and sense of self worth is a blend of both confidence and insecurities depending on the circumstances.",

  "SelfEsteem_high":"You have a high sense of love towards yourself. Your aplomb and confidence often helps you stride over tough times. Your self esteem commands respect.",

  "Failure_negative": "Failures and setbacks may enrich your experience, test your emotional intelligence and add to your knowledge and skills. Your fear of failure may prevent you from using your potentials to the optimum and act as a roadblock in your path to success.",

  "Failure_positive":"You believe that failure is a necessary to gain success. You take inspiration from the countless failure stories which you come across. Failures do not have the potential to defeat you and your ability to fight back setbacks and come out strong is phenomenal.",

  "Approval_high":"Seeking approval and acceptance is a natural process. For you people’s approval may swing you through great arcs of approval or disapproval. This may affect your performance and cause you to become stressed and over critical about self.",

  "Approval_low":"Seeking approval and acceptance is a natural process. You are aware of and accept your strengths and weaknesses. For you making efforts and the experience matters more than the result and what others will think."
}
